export const meta = [
]

export const link = [
]

export const scripts = [
]

export const metaMainPage = {
    title: 'Нейросеть, которая рисует по словам онлайн | НейроХолст',
    meta: [{ name: 'description', content: 'Рисуй изображения с помощью нейросети онлайн. Пиши описания картинок на русском языке, гибко настраивай параметры рисунка, чтобы получить наилучшее качество. Попробуй НейроХолст бесплатно!' }]
}

export const metaGenerateImage = {
    title: 'Генерация изображений онлайн | НейроХолст',
    meta: [{ name: 'description', content: 'Генерируй изображения с помощью нейросети онлайн. Задавай запрос на русском языке. Попробуй сгенерировать изображение на НейроХолсте бесплатно!'}]
}

export const metaPricing = {
    title: 'Цены на генерацию изображений | НейроХолст',
    meta: [{ name: 'description', content: 'Узнайте сколько стоит нейросеть, которая рисует изображения по словам. Вы платите только за то, что используете. Никаких подписок, а попробовать можно бесплатно. Узнайте подробнее про НейроХолст!'}]
}

export const metaSettings = {
    title: 'Настройки аккаунта| НейроХолст',
    meta: [{ name: 'description', content: 'На этой странице вы можете настроить свой аккаунт'}]
}

export const metaGallery = {
    title: 'Галерея | НейроХолст',
    meta: [{ name: 'description', content: 'Галерея пользователя, в которой есть возможность просмотреть все сгенерированные изображения'}]
}

export const metaTransactions = {
    title: 'История транзакций| НейроХолст',
    meta: [{ name: 'description', content: 'На этой странице вы можете увидеть всю историю пополнений и покупок'}]
}

export const metaReferral = {
    title: 'Пригласить друзей | НейроХолст',
    meta: [{ name: 'description', content: 'На этой странице вы можете получить свою реферальную ссылку'}]

}


