<template>
  <Legal>
    <InfoWrapper :title="'Политика отмены'" :update="'Последнее обновление: 11 ноября 2022г.'">
      <article class="info">
        <p>Нам нужны довольные клиенты, а не заложники. Вот почему мы упрощаем удаление вашей учетной записи прямо в
          нашем приложении — без телефонных звонков и вопросов.
        </p>
        <p>Наша юридическая ответственность заключается перед владельцами учетных записей, что означает, что мы не можем
          закрыть учетную запись по запросу кого-либо еще. Если по какой-либо причине вы больше не знаете, кто является
          владельцем аккаунта, напишите нам по электронной почте . Мы с радостью свяжемся с любыми текущими владельцами
          учетных записей по адресам электронной почты, которые у нас есть в файле.
        </p>

        <h2>Что происходит, когда вы отменяете?</h2>
        <p>Вы можете отменить подписку и продолжать использовать свою учетную запись, пока не истечет оплаченный период.
          Затем учетная запись будет автоматически переведена на бесплатный план, а это означает, что вам по-прежнему
          будет разрешено использовать наше приложение с ограниченным функционалом.
        </p>

        <h2>Отмены, инициированные Getimg.ai</h2>
        <p>Мы оставляем за собой право приостанавливать или прекращать действие учетных записей по любой причине в любое
          время, как указано в наших Условиях обслуживания . На практике это обычно означает, что мы закроем вашу
          учетную запись без предварительного уведомления, если у нас будут доказательства того, что вы используете наши
          продукты для оскорбительного поведения.
        </p>
      </article>
    </InfoWrapper>
  </Legal>
</template>

<script setup>
import Legal from "~/components/legal/Legal";
import InfoWrapper from "~/components/legal/InfoWrapper";
import seo from "~/mixins/seo";

const {setProperty} = seo();
setProperty('Политика отмены | getImages', '');
</script>

<style scoped lang="scss">
.info {
  display: flex;
  flex-direction: column;
  gap: 15px;
  color: rgba(255, 255, 225, 0.7);
  padding-top: 30px;
  font-size: 14px;

  h2{
    color: var(--main-light-color)
  }
}
</style>
