<template>
  <Legal>
    <InfoWrapper :title="'Политика конфиденциальности'" :update="'Последнее обновление: 23 сентября 2022 г.'">
      <article class="info">
        <p>Конфиденциальность ваших данных - и это ваши данные, а не наши! - это большое дело для нас. В этой политике
          мы указываем: какие данные мы собираем и почему; как обрабатываются ваши данные; и ваши права на ваши данные.
          Мы обещаем, что никогда не продадим ваши данные: никогда и никогда не будем.
        </p>
        <p>Эта политика распространяется на все продукты, созданные и поддерживаемые Webrockets Sp. о.о.
        </p>

        <h2>Что мы собираем и почему</h2>
        <p>Наш принцип – собирать только то, что нам нужно. Вот что это значит на практике.</p>

        <h3>Личность и доступ</h3>
        <p>Когда вы подписываетесь на продукт Webrockets, мы обычно запрашиваем идентифицирующую информацию, такую ​​как
          ваше имя, адрес электронной почты и, возможно, название компании . Это просто для того, чтобы вы могли
          персонализировать свою новую учетную запись, и мы могли отправлять вам счета, обновления или другую важную
          информацию. Мы никогда не будем продавать вашу личную информацию третьим лицам, а также не будем использовать
          ваше имя или компанию в маркетинговых заявлениях без вашего разрешения.
        </p>

        <h3>Данные геолокации</h3>
        <p>Мы регистрируем все доступы ко всем учетным записям по полному IP-адресу, чтобы мы всегда могли убедиться,
          что не было несанкционированного доступа. Мы храним эти данные для входа, пока ваша учетная запись продукта
          активна.
        </p>
        <p>Мы также регистрируем полные IP-адреса, используемые для регистрации учетной записи продукта. Мы храним эти
          записи навсегда, потому что они используются для уменьшения регистрации спама.
        </p>
        <p>Данные веб-аналитики, описанные далее в разделе «Взаимодействие с веб-сайтом», также временно привязываются к
          IP-адресам, чтобы помочь в устранении неполадок.
        </p>

        <h3>Взаимодействие с сайтом</h3>
        <p>Когда вы просматриваете наши маркетинговые страницы или приложения, ваш браузер автоматически передает
          определенную информацию, например, какую операционную систему и версию браузера вы используете. Мы отслеживаем
          эту информацию вместе со страницами, которые вы посещаете, временем загрузки страниц и тем, какой веб-сайт
          направил вас для статистических целей, таких как коэффициенты конверсии и для тестирования новых дизайнов.
          Иногда мы отслеживаем переходы по конкретным ссылкам, чтобы помочь принять некоторые дизайнерские решения. Эти
          данные веб-аналитики привязаны к вашему IP-адресу и учетной записи пользователя, если это применимо, и вы
          вошли в наши Сервисы.
        </p>

        <h3>Файлы cookie и не отслеживать</h3>
        <p>Мы используем постоянные собственные файлы cookie для сохранения определенных предпочтений, упрощения
          использования наших приложений и поддержки некоторой внутренней аналитики. Файл cookie — это фрагмент текста,
          сохраняемый вашим браузером, чтобы помочь ему запомнить вашу регистрационную информацию, настройки сайта и
          многое другое. Вы можете настроить параметры хранения файлов cookie в своем браузере. Чтобы узнать больше о
          файлах cookie, в том числе о том, как просмотреть, какие файлы cookie были установлены, а также как управлять
          ими и удалять их, посетите: www.allaboutcookies.org .
        </p>
        <p>В настоящее время наши сайты и приложения не реагируют на маячки «Не отслеживать», отправляемые подключаемыми
          модулями браузера.
        </p>

        <h3>Добровольная переписка</h3>
        <p>Когда вы пишете на getimg.ai с вопросом или с просьбой о помощи, мы сохраняем эту переписку, включая адрес
          электронной почты, чтобы у нас была история прошлых переписок, на которую можно ссылаться, если вы обратитесь
          в будущем.</p>
        <p>Мы также храним любую информацию, которую вы добровольно предоставляете, например опросы. Иногда, когда мы
          проводим интервью с клиентами, мы можем попросить вашего разрешения на запись разговора для дальнейшего
          использования. Мы делаем это только в том случае, если вы даете свое прямое согласие.
        </p>

        <h3>Информация, которую мы не собираем</h3>
        <p>Мы не собираем какие-либо характеристики защищенных классификаций, включая возраст, расу, пол, религию,
          сексуальную ориентацию, гендерную идентичность, гендерное выражение или физические и умственные способности
          или инвалидность. Вы можете предоставить эти данные добровольно, например, если вы включаете предпочтительное
          местоимение в свою подпись электронной почты, когда пишете в нашу службу поддержки.
        </p>

        <h2>Когда мы получаем доступ к вашей информации или передаем ее</h2>
        <p>Наша практика по умолчанию — не получать доступ к вашей информации. Мы можем получить доступ к вашей
          информации или поделиться ею только в следующих случаях:
        </p>
        <p>Для предоставления запрошенных вами продуктов или услуг . Мы используем некоторые сторонние сервисы для
          запуска наших Сервисов и только в той мере, в какой это необходимо, обрабатываем часть или всю вашу личную
          информацию через этих третьих лиц. Вы можете просмотреть список сторонних сервисов, которые мы используем:
          подпроцессоры .
        </p>
        <p>Для расследования, предотвращения или принятия мер в отношении ограниченного использования . Доступ к учетной
          записи клиента при расследовании возможных злоупотреблений является крайней мерой. Мы обязаны защищать
          конфиденциальность и безопасность как наших клиентов, так и людей, сообщающих нам о проблемах. Мы делаем все
          возможное, чтобы сбалансировать эти обязанности на протяжении всего процесса. Если мы обнаружим, что вы
          используете наши продукты в ограниченных целях, мы сообщим об этом в соответствующие органы.
        </p>

        <h2>Ваши права в отношении вашей информации</h2>
        <p>В getimg.ai мы применяем одни и те же права на данные ко всем клиентам, независимо от их местонахождения. В
          настоящее время одними из наиболее важных правил конфиденциальности являются Общий регламент ЕС по защите
          данных («GDPR») и Калифорнийский закон о конфиденциальности потребителей («CCPA») в США. getimg.ai признает
          все права, предоставленные в этих правилах, за исключением случаев, когда они ограничены применимым
          законодательством. Эти права включают в себя:
        </p>
        <ul>
          <li>Право знать. Вы имеете право знать, какая личная информация собирается, используется, передается или
            продается. В этой политике конфиденциальности мы описываем как категории, так и конкретные данные, которые
            мы собираем, а также то, как они используются.
          </li>
          <li>Право доступа. Это включает ваше право на доступ к личной информации, которую мы собираем о вас, и ваше
            право на получение информации о совместном использовании, хранении, безопасности и обработке этой
            информации.
          </li>
          <li>Право на исправление. Вы имеете право запросить исправление вашей личной информации.</li>
          <li>Право на стирание / «Быть ​​забытым». Это ваше право потребовать, с учетом определенных ограничений в
            соответствии с применимым законодательством, чтобы ваша личная информация была удалена из нашего владения и,
            соответственно, из всех наших поставщиков услуг. Выполнение некоторых запросов на удаление данных может
            помешать вам использовать службы getimg.ai, поскольку наши приложения могут перестать работать. В таких
            случаях запрос на удаление данных может привести к закрытию вашей учетной записи.
          </li>
          <li>Право на жалобу. Вы имеете право подать жалобу относительно нашего обращения с вашей личной информацией в
            соответствующий надзорный орган. Чтобы определить ваши конкретные полномочия или узнать больше об этом
            праве, лица из ЕС должны перейти на https://edpb.europa.eu/about-edpb/board/members_en .
          </li>
          <li>Право на ограничение обработки. Это ваше право потребовать ограничения того, как и почему ваша личная
            информация используется или обрабатывается, включая отказ от продажи личной информации. (Еще раз: мы никогда
            не продаем и не будем продавать ваши личные данные.)
          </li>
          <li>Право на возражение. Вы имеете право в определенных ситуациях возражать против того, как и почему
            обрабатывается ваша личная информация.
          </li>
          <li>Право на переносимость. Вы имеете право получать имеющуюся у нас личную информацию о вас и право
            передавать ее другой стороне.
          </li>
          <li>Право не подвергаться автоматизированному принятию решений. Вы имеете право возражать и препятствовать
            принятию любого решения, которое может иметь юридические или аналогичные существенные последствия для вас,
            исключительно на основе автоматизированных процессов. Однако это право ограничено, если решение необходимо
            для выполнения какого-либо договора между вами и нами, разрешено применимым законодательством или основано
            на вашем прямом согласии.
          </li>
          <li>Право на недискриминацию. Это право вытекает из CCPA. Мы не взимаем и не будем взимать с вас другую сумму
            за использование наших продуктов, предлагать вам различные скидки или предоставлять вам более низкий уровень
            обслуживания клиентов, потому что вы воспользовались своими правами на конфиденциальность данных. Однако
            осуществление определенных прав (например, права «быть забытым») может в силу того, что вы пользуетесь этими
            правами, помешать вам пользоваться нашими Услугами.
          </li>
        </ul>
        <p>Многие из этих прав можно реализовать, войдя в систему и непосредственно обновив данные своей учетной
          записи.
        </p>
        <p>Если у вас есть вопросы об использовании этих прав или вам нужна помощь, свяжитесь с нами по адресу
          hi@getimg.ai или по адресу Webrockets Sp. z oo Okopowa 47a/40, 01-059 Варшава, Польша. Для запросов на
          удаление личной информации или получение информации о том, какая личная информация была собрана, мы сначала
          проверим вашу личность, используя комбинацию как минимум двух уже собранных данных, включая ваш адрес
          электронной почты пользователя. Если уполномоченный агент ведет переписку от вашего имени, нам сначала
          потребуется письменное согласие с подписью владельца учетной записи, прежде чем продолжить.
        </p>
        <p>Если вы находитесь в ЕС, вы можете указать свой конкретный орган для подачи жалобы или узнать больше о GDPR
          на странице https://edpb.europa.eu/about-edpb/board/members_en .
        </p>


        <h2>Как мы защищаем ваши данные</h2>
        <p>Все данные шифруются с помощью SSL/TLS при передаче с наших серверов в ваш браузер. Резервные копии базы
          данных также зашифрованы.
        </p>
        <p>Большинство данных не шифруются, пока они находятся в нашей базе данных (поскольку они должны быть готовы к
          отправке вам, когда они вам понадобятся), но мы делаем все возможное, чтобы защитить ваши данные в состоянии
          покоя.
        </p>

        <h2>Изменения и вопросы</h2>
        <p>Мы можем обновлять эту политику по мере необходимости, чтобы соответствовать соответствующим правилам и
          отражать любые новые методы.
        </p>
        <p>У вас есть какие-либо вопросы, комментарии или опасения по поводу этой политики конфиденциальности, ваших
          данных или ваших прав в отношении вашей информации? Пожалуйста, свяжитесь с нами по электронной почте
          hi@getimg.ai , и мы будем рады ответить на них!
        </p>
      </article>
    </InfoWrapper>
  </Legal>
</template>

<script setup>
import Legal from "~/components/legal/Legal";
import InfoWrapper from "~/components/legal/InfoWrapper";
import seo from "~/mixins/seo";

const {setProperty} = seo();
setProperty('Политика конфиденциальности | getImages', '');
</script>

<style scoped lang="scss">

.info {
  display: flex;
  flex-direction: column;
  gap: 15px;
  color: rgba(255, 255, 225, 0.7);
  padding-top: 30px;
  font-size: 14px;

  h2, h3 {
    color: var(--main-light-color)
  }

  ul {
    margin-left: 30px;

    li {
      margin-bottom: 20px;
    }
  }

  .description {
    color: var(--main-light-color);
    font-weight: bold;
  }
}
</style>
