<template>
  <Legal>
    <InfoWrapper :title="'Использовать ограничения'" :update="'Последнее обновление: 11 ноября 2022г.'">
      <article class="info">
        <p>Мы понимаем, что какими бы хорошими ни были намерения пользователя, технология может усилить способность
          причинять большой вред. Вот почему мы установили эту политику. Мы чувствуем этическое обязательство
          противодействовать такому вреду: как с точки зрения рассмотрения случаев, когда сайт getimg.ai используется (и
          злоупотребляет) для нанесения такого вреда, так и с точки зрения недвусмысленного заявления о том, что
          продукты,
          которые мы производим на getimg.ai, не являются убежищем для лица, желающие причинить такой вред. Если у вас
          есть учетная запись в каком-либо из наших продуктов, вы не можете использовать их ни для каких ограниченных
          целей, перечисленных ниже. Если мы узнаем, что вы, мы примем меры.
        </p>

        <h2>Ограниченные цели</h2>

        <ul>
          <li>Насилие или угроза его применения : если какое-либо действие квалифицируется каким-либо образом как
            насильственное преступление в любом применимом законодательстве или постановлении ЕС, национальном,
            федеральном, государственном, местном или международном законодательстве, вы не можете использовать продукты
            getimg.ai для планирования, совершения действий или угроз. эта деятельность.
          </li>
          <li>Эксплуатация детей, сексуализация или жестокое обращение . Мы не приемлем никаких действий, которые
            создают,
            распространяют или иным образом вызывают жестокое обращение с детьми. Отойди и остановись. Просто
            остановись.
          </li>
          <li>Разжигание ненависти . Вы не можете использовать наши продукты для пропаганды истребления, господства или
            угнетения людей. Эксплуатация, причинение вреда или попытка эксплуатации или причинения вреда
            несовершеннолетним каким-либо образом запрещены.
          </li>
          <li>Притеснение : на getimg.ai не приветствуется запугивание или преследование людей или групп путем
            повторного
            общения, в том числе с использованием расистских оскорблений или бесчеловечных выражений.
          </li>
          <li>Doxing : Если вы используете продукты getimg.ai для обмена частной личной информацией других людей в целях
            преследования, мы не хотим иметь с вами ничего общего.
          </li>
          <li>Вредоносное или шпионское ПО : код во благо, а не во зло. Если вы используете наши продукты для создания
            или
            распространения чего-либо, что квалифицируется как вредоносное или шпионское ПО, включая удаленное
            наблюдение
            за пользователями, оставьте их.
          </li>
          <li>Фишинг или иная попытка мошенничества : недопустимо лгать о том, кто вы или с кем вы связаны, чтобы
            красть,
            вымогать или иным образом причинять вред другим.
          </li>
          <li>Киберсквоттинг : мы не любим вымогателей имен пользователей. Если вы покупаете учетную запись продукта
            getimg.ai на чье-то имя, а затем пытаетесь продать эту учетную запись им, вы совершаете киберсквоттинг .
            Учетные записи киберсквоттинга подлежат немедленному аннулированию.
          </li>
          <li>Нарушение прав интеллектуальной собственности . Вы не можете использовать продукты getimg.ai для создания
            или распространения работ, в которых используется интеллектуальная собственность других лиц, выходящая за
            рамки добросовестного использования .
          </li>
          <li>Поддельные новости : вы не можете создавать или распространять достоверно ложную информацию и/или контент
            с
            целью причинения вреда другим.
          </li>
          <li>Клевета на других : Вы не можете клеветать, унижать или иным образом беспокоить других.</li>

          <ul>
            <li>Для полностью автоматизированного принятия решений, которые неблагоприятно влияют на законные права
              человека или иным образом создают или изменяют обязательные, подлежащие исполнению обязательства;
            </li>
            <li>За любое использование, предназначенное или приводящее к дискриминации или причинению вреда отдельным
              лицам или группам на основе социального поведения в сети или вне ее или известных или предполагаемых
              личных или личностных характеристик;
            </li>
            <li>Использовать любую из уязвимостей определенной группы лиц на основе их возрастных, социальных,
              физических или психических характеристик, чтобы существенно исказить поведение лица, относящегося к этой
              группе, таким образом, который причиняет или может причинить это лицо или другому лицу физический или
              психологический вред;
            </li>
            <li>Для любого использования, предназначенного или приводящего к дискриминации отдельных лиц или групп на
              основе охраняемых законом характеристик или категорий;
            </li>
            <li>Предоставление медицинских консультаций и интерпретация медицинских результатов;</li>
            <li>Для создания или распространения информации с целью ее использования в процессах отправления
              правосудия,
              правоохранительных органов, иммиграции или предоставления убежища, например, для прогнозирования того,
              что
              лицо совершит мошенничество/преступление (например, путем профилирования текста, установления
              причинно-следственных связей между утверждениями, сделанными в документах, неизбирательное и произвольно
              целевое использование).
            </li>
          </ul>
        </ul>

        <p>Хотя наши ограничения на использование носят всеобъемлющий характер, они не могут быть исчерпывающими —
          возможно, нарушение не поддается категоризации, присутствует впервые или освещает моральное затруднение,
          которое
          мы еще не рассматривали. Тем не менее, мы надеемся, что общая идея ясна: getimg.ai нельзя использовать для
          причинения вреда, будь то умственного, физического, личного или гражданского. Различные точки зрения —
          философские, религиозные и политические — приветствуются, но такие идеологии, как нацизм, коммунизм или
          подпитываемые ненавистью движения, основанные на угнетении, насилии, жестоком обращении, истреблении или
          господстве одной группы над другой, здесь не принимаются.
        </p>

        <h2>Как сообщить о нарушении</h2>
        <p>О случаях подозрения на вредоносное ПО, шпионское ПО, фишинг, рассылку спама и киберсквоттинг сообщите нам по
          адресу hi@getimg.ai .
        </p>
        <p>Во всех других случаях, пожалуйста, сообщите нам об этом по электронной почте hi@getimg.ai . Если вы не
          уверены
          на 100 %, что что-то соответствует нашей политике ограничения использования, все равно сообщите об этом.
        </p>
        <p>Расскажите, как вам удобно, об учетной записи, контенте или поведении, о которых вы сообщаете, и о том, как
          вы
          их нашли. Отправка нам URL-адреса или снимков экрана очень полезна. Мы не будем раскрывать вашу личность
          никому,
          связанному с заявленной учетной записью.
        </p>
        <p>Кто-то из нашей команды ответит в течение одного рабочего дня и сообщит вам, что мы начали расследование. Мы
          также сообщим вам о результатах нашего расследования (если только вы не попросите нас не делать этого или нам
          это не разрешено законом).
        </p>
        <p>Эта политика и процесс применяются к любому продукту, созданному и принадлежащему Webrockets Sp. о.о.</p>
      </article>
    </InfoWrapper>
  </Legal>
</template>

<script setup>
import Legal from "~/components/legal/Legal";
import InfoWrapper from "~/components/legal/InfoWrapper";
import seo from "~/mixins/seo";

const {setProperty} = seo();
setProperty('Ограничения | getImages', '');
</script>

<style scoped lang="scss">
.info {
  display: flex;
  flex-direction: column;
  gap: 15px;
  color: rgba(255, 255, 225, 0.7);
  padding-top: 30px;
  font-size: 14px;

  h2{
    color: var(--main-light-color)
  }

  ul {
    margin-left: 30px;

    li {
      margin-bottom: 20px;
    }
  }
}
</style>
