<template>
  <Legal>
    <InfoWrapper :title="'Условия использования'" :update="'Последнее обновление: 11 ноября 2022г.'">
      <article class="info">
        <p>Спасибо всем на getimg.ai за использование наших продуктов! Поскольку мы не знаем каждого из наших
          пользователей лично, мы должны установить некоторые Условия использования, чтобы помочь удержать корабль на
          плаву.
        </p>
        <p>Когда мы говорим «Компания», «мы», «наш» или «нас», «Webbrockets» в этом документе, мы имеем в виду
          Webbrockets Sp. z oo - наша "Компания с ограниченной ответственностью" с местонахождением в Польше.</p>
        <p>Когда мы говорим «Услуги», мы имеем в виду любой продукт, созданный и поддерживаемый Webrockets. Это включает
          в себя getimg.ai независимо от того, доставляется ли он в веб-браузере, настольном приложении, мобильном
          приложении или в другом формате.
        </p>
        <p>Когда мы говорим «вы» или «ваш», мы имеем в виду людей или организации, у которых есть учетная запись в одной
          или нескольких наших службах.
        </p>
        <p>Мы можем обновить настоящие Условия использования в будущем.</p>
        <p>Когда вы используете наши Услуги сейчас или в будущем, вы соглашаетесь с последними Условиями обслуживания.
          Это верно для любого из наших существующих и будущих продуктов и всех функций, которые мы добавляем в наши
          Сервисы с течением времени. Могут быть случаи, когда мы не реализуем и не применяем какое-либо право или
          положение Условий обслуживания; при этом мы не отказываемся от этого права или положения. Эти условия содержат
          ограничение нашей ответственности.
        </p>
        <p>Если вы нарушите какое-либо из условий, мы можем закрыть вашу учетную запись. Это широкое заявление, и это
          означает, что вы должны доверять нам.
        </p>

        <h2>Условия учетной записи</h2>
        <ol>
          <li>Вы несете ответственность за обеспечение безопасности вашей учетной записи и пароля. Компания не может и
            не будет нести ответственность за какие-либо убытки или ущерб в результате несоблюдения вами этого
            обязательства по обеспечению безопасности.
          </li>
          <li>Вы не можете использовать Услуги для каких-либо целей, указанных в нашей политике ограничений
            использования.
          </li>
          <li>Вы несете ответственность за весь публикуемый контент и действия, которые происходят под вашей учетной
            записью. Это включает в себя контент, размещенный другими лицами, которые: (а) имеют доступ к вашим учетным
            данным для входа; или (б) иметь свои собственные логины под вашей учетной записью.
          </li>
          <li>Вы должны быть человеком. Учетные записи, зарегистрированные с помощью «ботов» или других
            автоматизированных методов, запрещены.
          </li>
        </ol>

        <h2>Платежи</h2>
        <ol>
          <li>Некоторые функции Сервиса могут потребовать оплаты.</li>
          <li>Вы можете выбрать между единовременной оплатой или ежемесячной подпиской. Цены и различия между планами
            подписки описаны на нашей странице.
          </li>
          <li>Для повышения или понижения уровня плана новая ставка начинается со следующего платежного цикла. При
            обновлении в середине месячной подписки с вас будет взиматься плата пропорционально времени, оставшемуся до
            окончания текущего срока подписки.
          </li>
          <li>Цены на Сервис включают НДС и все применимые местные налоги.</li>
          <li>Оплата Услуги должна быть произведена кредитной или дебетовой картой. Платежи обрабатываются третьей
            стороной , сертифицированной в соответствии с PCI Service Provider Level 1. Мы не имеем доступа и не храним
            платежную информацию.
          </li>
        </ol>

        <h2>Изменения в услугах и ценах</h2>
        <ol>
          <li>Мы оставляем за собой право в любое время изменять или прекращать, временно или постоянно, любую часть
            наших Услуг с уведомлением или без него.
          </li>
          <li>Мы оставляем за собой право изменять структуру ценообразования нашего продукта. Мы постараемся освободить
            существующих клиентов от этих изменений. Однако мы можем изменить цены для существующих клиентов. Если мы
            это сделаем, мы уведомим вас как минимум за 7 дней и уведомим вас по зарегистрированному адресу электронной
            почты. Мы также можем публиковать уведомления об изменениях на нашем веб-сайте.
          </li>
        </ol>

        <h2>Время работы, безопасность и конфиденциальность</h2>
        <ol>
          <li>Вы используете Услуги на свой страх и риск. Мы предоставляем эти Услуги на условиях «как есть» и «по мере
            доступности». Мы пока не предлагаем соглашения об уровне обслуживания для большинства наших Сервисов, но
            серьезно относимся к времени безотказной работы наших приложений.
          </li>
          <li>Мы оставляем за собой право временно отключить вашу учетную запись, если ваше использование значительно
            превышает среднее использование других клиентов Услуг. Конечно, мы свяжемся с владельцем учетной записи,
            прежде чем предпринимать какие-либо действия, за исключением редких случаев, когда уровень использования
            может негативно повлиять на производительность Сервиса для других клиентов.
          </li>
          <li>Мы принимаем множество мер для защиты и защиты ваших данных посредством резервного копирования,
            избыточности и шифрования. Мы применяем шифрование для передачи данных из общедоступного Интернета.
          </li>
          <li>Когда вы пользуетесь нашими Услугами, вы доверяете нам свои данные. Мы принимаем это доверие близко к
            сердцу. Вы соглашаетесь с тем, что getimg.ai может обрабатывать ваши данные, как описано в нашей Политике
            конфиденциальности , и ни для каких других целей.
          </li>
          <li>Мы используем некоторых сторонних поставщиков и партнеров по хостингу для предоставления необходимого
            оборудования, программного обеспечения, сети, хранилища и сопутствующих технологий, необходимых для запуска
            Услуг. Полный список наших субпроцессоров смотрите здесь.
          </li>
        </ol>

        <h2>Авторское право и право собственности на контент</h2>
        <ol>
          <li>Весь контент, размещенный в Сервисах, должен соответствовать законодательству ЕС об авторском праве.</li>
          <li>Мы не претендуем на права интеллектуальной собственности на материалы, которые вы предоставляете Сервисам.
            Все загруженные материалы остаются вашими.
          </li>
          <li>Названия, внешний вид и функции Сервисов защищены авторским правом © Компании. Все права защищены. Вы не
            можете дублировать, копировать или повторно использовать любую часть HTML, CSS, JavaScript или элементов
            визуального дизайна без письменного разрешения Компании. Вы должны запросить разрешение на использование
            логотипа Компании или любых логотипов Служб в рекламных целях. Пожалуйста , напишите нам запросы на
            использование логотипов. Мы оставляем за собой право отозвать это разрешение, если вы нарушите настоящие
            Условия обслуживания.
          </li>
          <li>Вы соглашаетесь не воспроизводить, дублировать, копировать, продавать, перепродавать или использовать
            какую-либо часть Услуг, использование Услуг или доступ к Услугам без письменного разрешения Компании.
          </li>
          <li>Вы не должны изменять другой веб-сайт таким образом, чтобы ложно предположить, что он связан с Услугами
            или Компанией.
          </li>
        </ol>

        <h2>Особенности и ошибки</h2>
        <p>Мы тщательно разрабатываем наши Услуги, основываясь на собственном опыте и опыте клиентов, которые делятся
          своим временем и отзывами. Однако не существует такой вещи, как услуга, которая удовлетворит всех. Мы не даем
          никаких гарантий, что наш Сервис будет соответствовать вашим конкретным требованиям или ожиданиям.
        </p>
        <p>Мы также тщательно тестируем все наши функции перед их отправкой. Как и в любом программном обеспечении, наш
          Сервис неизбежно имеет некоторые ошибки. Мы отслеживаем ошибки, о которых нам сообщают, и работаем над
          приоритетными, особенно теми, которые связаны с безопасностью или конфиденциальностью. Не все обнаруженные
          ошибки будут исправлены, и мы не гарантируем полностью безошибочное обслуживание.
        </p>

        <h2>Обязанность</h2>
        <p>Мы упоминаем об ответственности в настоящих Условиях, но в одном разделе:</p>
        <i>Вы прямо понимаете и соглашаетесь с тем, что Компания не несет ответственности по закону или по праву
          справедливости перед вами или любой третьей стороной за любые прямые, косвенные, случайные, упущенную выгоду,
          специальные, косвенные, штрафные или штрафные убытки, включая, но не ограничивается убытками в связи с
          упущенной выгодой, репутацией, использованием, данными или другими нематериальными потерями (даже если
          Компания была уведомлена о возможности таких убытков), возникающими в результате: (i) использования или
          невозможности использования Услуг; (ii) стоимость приобретения замещающих товаров и услуг в результате любых
          товаров, данных, информации или услуг, приобретенных или полученных, или полученных сообщений, или транзакций,
          заключенных посредством или посредством Услуг; (iii) несанкционированный доступ или изменение ваших передач
          или данных; (iv) заявления или поведение любого третьего лица в сервисе;
        </i>
        <p>Если у вас есть вопросы по любому из Условий предоставления услуг, обратитесь в нашу службу поддержки.</p>
      </article>
    </InfoWrapper>
  </Legal>
</template>

<script setup>
import Legal from "~/components/legal/Legal";
import InfoWrapper from "~/components/legal/InfoWrapper";
import seo from "~/mixins/seo";

const {setProperty} = seo();
setProperty('Условия использования | getImages', '');
</script>

<style scoped lang="scss">
.info {
  display: flex;
  flex-direction: column;
  gap: 15px;
  color: rgba(255, 255, 225, 0.7);
  padding-top: 30px;
  font-size: 14px;

  h2 {
    color: var(--main-light-color)
  }

  ol {
    margin-left: 30px;

    li {
      margin-bottom: 20px;
    }
  }

  .description {
    color: var(--main-light-color);
    font-weight: bold;
  }
}
</style>
