<template>
  <Legal>
    <InfoWrapper :title="'Пользовательское соглашение'" :update="'Последнее обновление: 14 июнь 2023г.'">
      <article class="info">
        <p>Настоящий документ «Пользовательское соглашение» представляет собой предложение ИП Якунина Владислава
          Ивановича (далее — «Администрация»), заключить договор на изложенных ниже условиях Соглашения.
        </p>

        <h2>1. Общие положения Пользовательского соглашения</h2>
        <h3>1.1. В настоящем документе и вытекающих или связанным с ним отношениях Сторон применяются следующие термины
          и определения:</h3>
        <p>а) Платформа — программно-аппаратные средства, интегрированные с Сайтом Администрации.</p>
        <p>б) Пользователь — дееспособное физическое лицо, присоединившееся к настоящему Соглашению в собственном
          интересе либо выступающее от имени и в интересах представляемого им юридического лица.</p>
        <p>в) Сайт Администрации/ Сайт — интернет-сайты, размещенные в домене neuro-holst.ru и его поддоменах.</p>
        <p>г) Сервис — комплекс услуг и лицензия, предоставляемые Пользователю с использованием Платформы.</p>
        <p>д) Соглашение — настоящее соглашение со всеми дополнениями и изменениями.</p>

        <h3>1.2. Использование вами Сервиса любым способом и в любой форме в пределах его объявленных функциональных
          возможностей, включая:</h3>
        <ul>
          <li>Просмотр размещенных на Сайте материалов;</li>
          <li>Регистрация и/или авторизация на Сайте;</li>
          <li>Размещение или отображение на Сайте любых материалов, включая но не ограничиваясь такими как: тексты,
            гипертекстовые ссылки, изображения, аудио и видео- файлы, сведения и/или иная информация;
          </li>
        </ul>
        <p>Создает договор на условиях настоящего Соглашения в соответствии с положениями ст.437 и 438 Гражданского
          кодекса Российской Федерации.</p>

        <h3>1.3. Воспользовавшись любой из указанных выше возможностей по использованию Сервиса вы подтверждаете,
          что:</h3>
        <p>а) Ознакомились с условиями настоящего Соглашения в полном объеме до начала использования Сервиса.</p>
        <p>б) Принимаете все условия настоящего Соглашения в полном объеме без каких-либо изъятий и ограничений с вашей
          стороны и обязуетесь их соблюдать или прекратить использование Сервиса. Если вы не согласны с условиями
          настоящего Соглашения или не имеете права на заключение договора на их основе, вам следует незамедлительно
          прекратить любое использование Сервиса.</p>
        <p>в) Соглашение (в том числе любая из его частей) может быть изменено Администрацией без какого-либо
          специального уведомления. Новая редакция Соглашения вступает в силу с момента ее размещения на Сайте
          Администрации либо доведения до сведения Пользователя в иной удобной форме, если иное не предусмотрено новой
          редакцией Соглашения. Актуальное пользовательское соглашение находится по интернет адресу
          https://neuro-holst.ru/legal/terms-of-service</p>
        <p>г) Принимаете политику конфиденциальности, и ознакомлены и согласны с условиями возврата, которые доступны по
          интернет адресам https://neuro-holst.ru/legal/privacy-policy и
          https://neuro-holst.ru/legal/cancellation-policy</p>

        <h2>2. Общие условия пользования Сервисом</h2>

        <p>2.1. Использование функциональных возможностей Сервиса допускается только после прохождения Пользователем
          регистрации и авторизации на Сайте в соответствии с установленной Администрацией процедурой.
        </p>
        <p>2.2. Технические, организационные и коммерческие условия использования Сервиса, в том числе его
          функциональных
          возможностей доводятся до сведения Пользователей путем отдельного размещения на Сайте или путем нотификации
          Пользователей.
        </p>
        <p>2.3. Выбранные Пользователем логин и пароль являются необходимой и достаточной информацией для доступа
          Пользователя на Сайт. Пользователь не имеет права передавать свои логин и пароль третьим лицам, несет полную
          ответственность за их сохранность, самостоятельно выбирая способ их хранения.
        </p>
        <p>2.4. При использовании Сервиса запрещается размещать: Материалы противоречащие законодательству РФ; Объекты
          интеллектуальной собственности, копирование которых запрещено владельцами оригинала.
        </p>

        <h2>3. Гарантии сторон</h2>
        <p>3.1. Пользователь гарантирует, что любая деятельность, которой он занимается с использованием Сервиса не
          противоречит законодательству РФ и не нарушает прав третьих лиц.</p>
        <p>3.2. Администрация не гарантирует бесперебойную работу сервиса.</p>
        <p>3.3. Пользователь гарантирует соблюдать пользовательское соглашение при работе с Сервисом.</p>

        <h2>4. Ограничение ответственности</h2>
        <p>4.1. Администрация не несёт ответственность за любые действия пользователя нарушающие законодательство РФ или
          нарушающие права третьих лиц.</p>
        <p>4.2. Администрация не несёт ответственность за всевозможные упущенные выгоды или убытки по любым
          причинам.
        </p>

        <h2>5. Права сторон</h2>
        <p>5.1. Администрация вправе остановить возможность использования Сервиса пользователем в случае, если он
          нарушил
          условия и требования пользовательского соглашения, либо же Администрация в праве сделать это на своё
          усмотрение.
        </p>

        <h2>6. Согласие на рассылку</h2>
        <p>6.1. Принимая пользовательское соглашение, пользователь соглашается на рассылку сообщений от Администрации на
          его почтовый ящик.
        </p>
      </article>
    </InfoWrapper>
  </Legal>
</template>

<script setup>
import Legal from "~/components/legal/Legal";
import InfoWrapper from "~/components/legal/InfoWrapper";
import seo from "~/mixins/seo";

const {setProperty} = seo();
setProperty('Пользовательское соглашение | НейроХолст', '');
</script>

<style scoped lang="scss">
.info {
  display: flex;
  flex-direction: column;
  gap: 15px;
  color: rgba(255, 255, 225, 0.7);
  padding-top: 30px;
  font-size: 14px;

  h2,
  h3{
    color: var(--main-light-color)
  }

  h2{
    margin-top: 50px;
  }

  ul {
    margin-left: 30px;

    li {
      margin-bottom: 20px;
    }
  }

  .description {
    color: var(--main-light-color);
    font-weight: bold;
  }
}
</style>
